Repository: quyenlnph51158/final_project
Catalog: lib/app/l10n/app_*.arb
Languages: vi

# general_hotline
source: Hotline
vi: Đường dây nóng

# general_workingHours
source: Working Hours
vi: Giờ làm việc

# general_workingTime
source: From 8:00 AM - 10:00 PM
vi: Từ 8:00 Sáng - 22:00 Tối

# general_sendButton
source: Send
vi: Gửi

# general_copyright
source: Copyright © 2025 All Rights Reserved
vi: Bản quyền © 2025 Đã đăng ký

# general_coFounder
source: Co Founder
vi: Đồng sáng lập

# general_readMore
source: Read More
vi: Đọc thêm

# general_allReviews
source: All Reviews
vi: Tất cả đánh giá

# general_anonymousCustomer
source: Anonymous Customer
vi: Khách hàng ẩn danh

# general_selectTicket
source: Select Ticket
vi: Chọn vé

# general_lowestPrice
source: Lowest Price
vi: Giá thấp nhất

# general_bookingButton
source: BOOK TICKET
vi: ĐẶT VÉ

# general_changeButton
source: Change
vi: Đổi

# general_consultationButton
source: GET CONSULTATION
vi: NHẬN TƯ VẤN

# general_detailButton
source: Details
vi: Chi tiết

# general_passengerLabel
source: Passengers
vi: Hành khách

# general_totalPassengers
source: Passengers
vi: Hành khách

# general_viewAllTours
source: VIEW ALL
vi: XEM TẤT CẢ

# general_close
source: Close
vi: Đóng

# general_select
source: Select
vi: Chọn

# general_reviews
source: Reviews
vi: Đánh giá

# error_title
source: An error occurred
vi: Đã xảy ra lỗi

# error_noDataFound
source: No data found.
vi: Không tìm thấy dữ liệu.

# error_retryButton
source: Retry
vi: Thử lại

# error_loadingData
source: Loading data...
vi: Đang tải dữ liệu...

# error_dataLoadingFailed
source: Failed to load data:
vi: Không thể tải dữ liệu:

# error_tourListLoadingFailed
source: Tour List loading failed:
vi: Lỗi tải Tour List:

# error_categoryLoadingFailed
source: Category loading failed:
vi: Lỗi tải danh mục:

# error_flightDataLoadingFailed
source: Failed to load flight data:
vi: Không thể tải dữ liệu chuyến bay:

# error_flightSearchMissingInput
source: Please enter both departure and destination points.
vi: Vui lòng nhập đầy đủ điểm đi và điểm đến.

# error_flightSearchConnectionFailed
source: A connection error occurred:
vi: Đã xảy ra lỗi khi kết nối:

# error_tourNotFound
source: No matching tours found.
vi: Không tìm thấy tour nào phù hợp.

# error_image_load
source: Image failed to load
vi: Lỗi tải ảnh

# error_airportDataLoadingFailed
source: Failed to load airport data:
vi: Không thể tải dữ liệu sân bay:

# error_flight_date_invalid
source: Return date must be after departure date.
vi: Ngày trở về phải sau ngày đi.

# error_flight_seat_not_implemented
source: Seat code search feature is not yet implemented.
vi: Chức năng tìm kiếm Mã chỗ ngồi chưa được triển khai.

# error_flightOutboundDataLoadingFailed
source: Flight outbound loading failed!!!
vi: Không thể tải dữ liệu chuyến bay chiều đi!!!

# error_flightReturnDataLoadingFailed
source: Flight return loading failed!!!
vi: Không thể tải dữ liệu chuyến bay chiều về!!!

# tab_search
source: Search
vi: Tìm kiếm

# tab_cancel
source: Cancel
vi: Hủy

# tab_itinerary
source: Itinerary
vi: Hành trình

# tab_tour
source: Tour
vi: Tour Du Lịch

# tab_flight
source: Flight
vi: Vé Máy Bay

# tab_train
source: Train
vi: Tàu Hỏa

# tab_checkSchedule
source: Check Schedule
vi: Tra cứu lịch trình

# search_loading
source: Searching...
vi: Đang tìm kiếm...

# policy_loadDataFailed
source: Load data failed:
vi: Lỗi tải dữ liệu:

# policy_detail
source: Detail policy
vi: Chi tiết Chính sách

# policy_loadDataPolicyFailed
source: Load data policy failed
vi: Không tìm thấy dữ liệu chính sách.

# policy_loadDetailPolicyFailed
source: Load detail policy failed:
vi: Không thể tải chi tiết chính sách:

# policy_searchCodeArticleCode
source: Search code article failed {postId}.
vi: Không tìm thấy mã bài viết {postId}.

# train_directOfMove
source: Selected: {trainCompany} ({departureStation} → {arrivalStation})
vi: Đã chọn: {trainCompany} ({departureStation} → {arrivalStation})

# tour_detail_read_all_reviews
source: Read all reviews
vi: Đọc tất cả đánh giá

# tour_detail_based_on
source: Based on
vi: Dựa trên

# tour_detail_reviews_count
source: reviews
vi: đánh giá

# tour_detail_no_images
source: No images available
vi: Không có ảnh

# tour_detail_itinerary
source: Itinerary
vi: Lịch trình

# tour_detail_highlights
source: Highlights
vi: Điểm nhấn

# tour_detail_featured_sub
source: For you
vi: Dành cho bạn

# tour_detail_featured_main
source: Featured Tours
vi: Tour nổi bật

# tour_detail_no_tours
source: No suitable tours found.
vi: Không tìm thấy tour nào phù hợp.

# tour_detail_prev
source: Prev
vi: Trước

# tour_detail_next
source: Next
vi: Sau

# tour_detail_page_info
source: Page {current} / {total}
vi: Trang {current} / {total}

# reviews_all_title
source: All Reviews
vi: Tất cả đánh giá

# reviews_summary
source: Review Overview
vi: Tổng quan đánh giá

# reviews_filter_all
source: All
vi: Tất cả

# reviews_filter_star
source: stars ({count})
vi: sao ({count})

# tour_detail_tab_intro
source: Introduce
vi: Giới thiệu

# tour_detail_tab_schedule
source: Schedule
vi: Lịch trình

# tour_detail_tab_review
source: Review
vi: Đánh giá

# tour_detail_tab_question
source: Question
vi: Câu hỏi thường gặp

# tour_detail_you_should_consult
source: You should consult
vi: Bạn nên tham khảo

# menu_homeTitle
source: HOME
vi: TRANG CHỦ

# menu_flightTitle
source: FLIGHT TICKET
vi: VÉ MÁY BAY

# menu_trainTitle
source: TRAIN TICKET
vi: VÉ TÀU HỎA

# menu_bookNowButton
source: BOOK NOW
vi: ĐẶT NGAY

# menu_navigatingToBook
source: Navigating to Book Now page...
vi: Đang chuyển đến trang đặt ngay

# menu_tabFlight
source: Flight
vi: Máy bay

# menu_tabTrain
source: Train
vi: Tàu

# form_defaultDestination
source: Destination
vi: Điểm đến

# form_defaultDeparture
source: Ha Noi
vi: Hà Nội

# form_defaultReturnDate
source: Not selected
vi: Chưa chọn

# form_defaultClass
source: Economy
vi: Phổ thông

# form_classPremiumEconomy
source: Premium Economy
vi: Phổ thông đặc biệt

# form_classBusiness
source: Business
vi: Thương gia

# form_classFirst
source: First Class
vi: Hạng nhất

# form_searchTourButton
source: Search Tour
vi: Tìm kiếm Tour

# form_searchFlightButton
source: Search Flight
vi: Tìm kiếm chuyến bay

# form_searchTrainButton
source: Search Train
vi: Tìm kiếm vé tàu

# form_confirmButton
source: Confirm
vi: Xác nhận

# form_tripRoundTrip
source: Round Trip
vi: Khứ hồi

# form_tripOneWay
source: One Way
vi: Một chiều

# form_labelDestination
source: Destination
vi: Điểm đến

# form_labelDepartureDate
source: Departure Date
vi: Ngày khởi hành

# form_labelDeparturePlace
source: Departure Place
vi: Điểm khởi hành

# form_labelFlightWhereGo
source: Where do you want to go?
vi: Bạn muốn đi đâu?

# form_labelFlightWhereArrive
source: Arrive ?
vi: Đến ?

# form_labelFlightDeparture
source: Departing From
vi: Khởi hành từ

# form_labelFlightArrival
source: Arriving At
vi: Đến tại

# form_labelFlightReturnDate
source: Return Date
vi: Ngày trở lại

# form_labelTrainDeparture
source: Departing from Station
vi: Khởi hành từ Ga

# form_labelTrainArrival
source: Arriving at Station
vi: Đến Ga tại

# form_labelTrainWhereArrive
source: Train arrive?
vi: Đến Ga nào?

# form_labelSearchHint
source: Search...
vi: Tìm kiếm...

# form_labelAdult
source: Adult
vi: Người lớn

# form_labelAdultSubtitle
source: 11+ years old
vi: 11+ tuổi

# form_labelChild
source: Child
vi: Trẻ em

# form_labelChildSubtitle
source: 2 - 11 years old
vi: 2 - 11 tuổi

# form_labelInfant
source: Infant
vi: Em bé

# form_labelInfantSubtitle
source: Under 2 years old (Lap)
vi: Dưới 2 tuổi (Ngồi lòng)

# form_labelTicketClass
source: Ticket Class
vi: Hạng vé

# form_modalSelectDestination
source: Select Destination
vi: Chọn Điểm Đến

# form_modalSelectAirportDeparture
source: Select Departure Airport
vi: Chọn Sân bay Khởi hành

# form_modalSelectAirportArrival
source: Select Arrival Airport
vi: Chọn Sân bay Đến

# form_modalSelectStationDeparture
source: Select Departure Station
vi: Chọn Ga Tàu Khởi hành

# form_modalSelectStationArrival
source: Select Arrival Station
vi: Chọn Ga Tàu Đến

# form_modalPassengerTitle
source: Passengers
vi: Hành khách

# form_modalSearchLocationHint
source: Search location...
vi: Tìm kiếm địa điểm...

# form_selectDestinationHint
source: Select Destination
vi: Chọn Điểm đến

# flight_screen_header_title
source: Find Your Perfect Flight
vi: Tìm kiếm chuyến bay phù hợp

# flight_screen_service_title
source: Elevate Your Experience with Extra Amenities
vi: Nâng tầm dịch vụ của bạn với những tiện ích bổ sung

# flight_screen_top_destinations
source: Top International Destinations
vi: Những điểm quốc tế hàng đầu

# flight_feature_luggage_title
source: Free 7kg Carry-on Baggage
vi: Hành lý xách tay miễn phí 7 kg

# flight_feature_luggage_sub
source: Carry up to 7kg of hand luggage free of charge.
vi: Mang theo tối đa 7 kg hành lý xách tay miễn phí.

# flight_feature_online_checkin_title
source: Online Check-in Available
vi: Có thể làm thủ tục trực tuyến

# flight_feature_online_checkin_sub
source: Easy online check-in in just a few steps, saving you time.
vi: Dễ dàng làm thủ tục trực tuyến chỉ trong vài bước, tiết kiệm thời gian.

# flight_feature_checkin_available_title
source: Check-in Open Early
vi: Thủ tục làm check-in có sẵn

# flight_feature_checkin_available_sub
source: Check-in starts 180 minutes before departure.
vi: Bắt đầu làm thủ tục check-in từ 180 phút trước giờ khởi hành.

# flight_error_fill_info
source: Please provide Departure, Destination, and Departure Date.
vi: Vui lòng điền đủ thông tin Khởi hành, Đến, và Ngày đi.

# flight_error_return_date
source: Return date must be after departure date.
vi: Ngày trờ về phải sau ngày đi.

# flight_error_empty_seat_code
source: Booking code and Email cannot be empty.
vi: Vui lòng không để trống Mã đặt chỗ và Email.

# flight_label_only_from
source: Only from
vi: Chỉ từ

# flight_results_outbound
source: Outbound
vi: Chiều đi

# flight_results_return
source: Return
vi: Chiều về

# flight_results_selected_outbound
source: Selected outbound: {flightCode} - {time}
vi: Chiều đi đã chọn: {flightCode} - {time}

# flight_results_found_count
source: {count} results found
vi: {count} kết quả tìm thấy

# flight_results_selecting_return
source: Outbound {code} selected. Loading return flights...
vi: Đã chọn chuyến đi {code}. Đang tải chuyến bay chiều về...

# flight_results_selected_final
source: Selected {type} flight {code}, Class: {seatClass}
vi: Đã chọn chuyến {type} {code}, Hạng ghế: {seatClass}

# flight_results_duration_min
source: {minutes} mins
vi: {minutes} phút

# flight_returnDate
source: Return date
vi: Ngày về

# flight_arrivalToWhichAirport
source: Which airport are you arriving at?
vi: Đến sân bay nào?

# flight_arrivalAtTheAirport
source: Arrive at the airport
vi: Đến sân bay tại

# flight_bookingCode
source: Booking code
vi: Mã đặt chỗ

# flight_seatCode
source: Seat code
vi: Mã chỗ ngồi

# flight_enterYourBookingCode
source: Enter your booking code
vi: Nhập mã đặt chỗ của bạn

# flight_enterYourSeatCode
source: Enter your seat code
vi: Nhập mã chỗ ngồi của bạn

# flight_enterYourEmail
source: Enter your email
vi: Nhập email của bạn

# flight_viewLatestDeals
source: View the latest departure deals
vi: Xem những ưu đãi khởi hành mới nhất

# flight_noFlightsFound
source: No suitable flights were found.
vi: Không tìm thấy chuyến bay nào phù hợp.

# flight_from
source: From
vi: Từ

# flight_to
source: to
vi: đến

# flight_extraServices
source: Additional services
vi: Dịch vụ bổ sung

# flight_searchNameOrCodeAirport
source: Search name or code airport ...
vi: Tìm kiếm tên hoặc mã sân bay ...

# flight_resultFlightDate
source: Date: {date}
vi: Ngày: {date}

# flight_stopNo
source: stop no
vi: điểm dừng

# flight_directFlight
source: Direct flight
vi: Bay thẳng

# flight_selectReturnTicket
source: Select
vi: Chọn vé về

# flight_selectOutboundTicket
source: Select
vi: Chọn vé đi

# flight_shrink
source: Shrink
vi: Gấp gọn

# flight_readDetailPolicyTicket
source: Read detail policy ticket
vi: Xem chi tiết chính sách vé

# flight_luggage
source: Luggage
vi: Hành lý

# flight_change
source: Change
vi: Thay đổi

# flight_returnTicket
source: Return ticket
vi: Hoàn vé

# flight_selectReturnFlight
source: Select return flight
vi: Chọn chuyến bay chiều về

# form_consultation_departure_date
source: Departure Date
vi: Ngày khởi hành

# form_consultation_departure_point
source: Departure Point
vi: Điểm khởi hành

# form_consultation_name_label
source: Full Name
vi: Họ và tên

# form_consultation_name_hint
source: Enter full name
vi: Nhập họ và tên

# form_consultation_phone_label
source: Phone Number
vi: Số điện thoại

# form_consultation_phone_hint
source: Enter phone number
vi: Nhập số điện thoại

# form_consultation_email_hint
source: Enter Email
vi: Nhập Email

# form_consultation_note_label
source: Special Requests
vi: Yêu cầu đặc biệt

# form_consultation_note_hint
source: Additional notes (if any)
vi: Ghi chú thêm (nếu có)

# form_consultation_policy_cancel
source: Cancellation Policy
vi: Chính sách hủy

# form_consultation_view_detail
source: View details.
vi: Xem chi tiết.

# form_consultation_book_now_pay_later
source: Book now and pay later
vi: Đặt trước và thanh toán sau

# form_consultation_flexible_desc
source: - Secure your spot while staying flexible.
vi: - Đảm bảo vị trí của bạn trong khi vẫn linh hoạt.

# form_consultation_submit_button
source: GET CONSULTATION
vi: NHẬN TƯ VẤN

# form_consultation_submitting_snackbar
source: Sending consultation request...
vi: Đang gửi yêu cầu tư vấn...

# form_consultation_success_msg
source: Success: {message}
vi: Thành công: {message}

# form_consultation_validation_error
source: Validation error: {error}
vi: Lỗi xác thực: {error}

# form_consultation_required_error
source: Please enter {field}
vi: Vui lòng nhập {field}

# form_consultation_app_title_mock
source: Flight Results
vi: Kết quả chuyến bay

# header_titleLine1
source: Make every trip a
vi: Để mỗi chuyến đi là

# header_titleLine2
source: delightful experience
vi: một trải nghiệm thú vị

# home_tourSectionTitleVibes
source: For You
vi: Dành cho bạn

# home_tourSectionTitleFeatured
source: Featured Tours
vi: Tour nổi bật

# home_tourSectionTitleSearch
source: Tours to
vi: Tour du lịch

# home_tourSearchSnackbar
source: Showing Featured Tours.
vi: Hiển thị Tour nổi bật.

# home_destinationSnackbar
source: Selected:
vi: Đã chọn:

# home_promotionSectionVibes
source: Offers
vi: Ưu đãi

# home_promotionSectionTitle
source: For You
vi: Dành cho bạn

# home_promotionSnackbar
source: You selected the offer:
vi: Bạn đã chọn ưu đãi:

# home_destinationsTitle
source: Tour Categories
vi: Danh mục Tour

# home_aboutUsVibes
source: Introduction
vi: Giới thiệu

# home_aboutUsTitleLine1
source: Welcome to
vi: Chào mừng bạn đến với

# home_aboutUsDescription
source: Wondering operates in the fields of tourism, flight tickets, and event organization in Vietnam. We always provide meticulous and dedicated services with the desire that "every trip is a worthwhile experience story". Our staff constantly strives to improve expertise and service quality.
vi: Wondering hoạt động trong lĩnh vực du lịch, vé máy bay và tổ chức sự kiện tại Việt Nam. Chúng tôi luôn mang đến dịch vụ chỉn chu, tận tâm với mong muốn "mỗi chuyến đi là một câu chuyện trải nghiệm xứng đáng". Đội ngũ nhân viên không ngừng trau dồi chuyên môn và nâng cao chất lượng phục vụ.

# home_aboutUsGuideTitle
source: Guide
vi: Hướng dẫn

# home_aboutUsGuideSubtitle
source: Connecting services across the country and internationally
vi: Kết nối dịch vụ rộng khắp trong và ngoài nước

# home_aboutUsMissionTitle
source: Vision & Mission
vi: Tầm nhìn & Sứ mệnh

# home_aboutUsMissionSubtitle
source: Enhancing worthwhile travel experiences.
vi: Nâng cao trải nghiệm du lịch xứng đáng.

# home_exploreButton
source: Start Exploring
vi: Bắt đầu khám phá

# home_exploreSnackbar
source: Starting exploration...
vi: Bắt đầu khám phá...

# home_trainSearchSnackbar
source: Searching... ($text)
vi: Đang tìm kiếm... ($text)

# footer_contact
source: Contact
vi: Liên hệ

# footer_introduce
source: About Us
vi: Giới thiệu

# footer_socialMediaConnect
source: Connect
vi: Kết nối

# footer_informationTitle
source: Information
vi: Thông tin

# footer_newsTitle
source: News
vi: Tin tức

# footer_cancellationPolicy
source: Cancellation Policy
vi: Chính sách hoàn hủy

# footer_guideTitle
source: Guide
vi: Hướng dẫn

# footer_registerOffer
source: Register for Offers
vi: Đăng ký ưu đãi

# footer_policyFlight
source: Flight Ticket
vi: Vé máy bay

# footer_policyTour
source: Tour
vi: Tour du lịch

# footer_policyTrain
source: Train Ticket
vi: Vé tàu

# footer_policyCruise
source: Cruise
vi: Du thuyền

# footer_introDescription
source: Wondering Vietnam specializes in providing and consulting services for domestic and international tours in Vietnam.
vi: Wondering Vietnam chuyên cung cấp và tư vấn các dịch vụ tour du lịch Việt Nam và Quốc tế.

# footer_addressDetail
source: Address: SH0212P1, Park 1 Tower, Vinhomes TimesCity Park Hill, 458 Minh Khai, Vinh Tuy, Hanoi
vi: Địa chỉ: SH0212P1, Tòa Park 1, Vinhomes TimesCity Park Hill, 458 Minh Khai, Vĩnh Tuy, Hà Nội

# footer_registerOfferDescription
source: Leave your email to receive the earliest promotional information.
vi: Để lại email để nhận được thông tin ưu đãi sớm nhất nhé.

# footer_emailSentSnackbar
source: Email registration for offers sent!
vi: Đã gửi email đăng ký ưu đãi!
